add mermaid support for md
